{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in c:\\balkanid\\.venv\\lib\\site-packages (5.11.0)\n",
      "Requirement already satisfied: pytz in c:\\balkanid\\.venv\\lib\\site-packages (from neo4j) (2023.3)\n",
      "Requirement already satisfied: torch_geometric in c:\\balkanid\\.venv\\lib\\site-packages (2.3.1)\n",
      "Requirement already satisfied: tqdm in c:\\balkanid\\.venv\\lib\\site-packages (from torch_geometric) (4.66.1)\n",
      "Requirement already satisfied: numpy in c:\\balkanid\\.venv\\lib\\site-packages (from torch_geometric) (1.24.4)\n",
      "Requirement already satisfied: scipy in c:\\balkanid\\.venv\\lib\\site-packages (from torch_geometric) (1.10.1)\n",
      "Requirement already satisfied: jinja2 in c:\\balkanid\\.venv\\lib\\site-packages (from torch_geometric) (3.1.2)\n",
      "Requirement already satisfied: requests in c:\\balkanid\\.venv\\lib\\site-packages (from torch_geometric) (2.31.0)\n",
      "Requirement already satisfied: pyparsing in c:\\balkanid\\.venv\\lib\\site-packages (from torch_geometric) (3.1.1)\n",
      "Requirement already satisfied: scikit-learn in c:\\balkanid\\.venv\\lib\\site-packages (from torch_geometric) (1.3.0)\n",
      "Requirement already satisfied: psutil>=5.8.0 in c:\\balkanid\\.venv\\lib\\site-packages (from torch_geometric) (5.9.5)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in c:\\balkanid\\.venv\\lib\\site-packages (from jinja2->torch_geometric) (2.1.3)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in c:\\balkanid\\.venv\\lib\\site-packages (from requests->torch_geometric) (3.2.0)\n",
      "Requirement already satisfied: idna<4,>=2.5 in c:\\balkanid\\.venv\\lib\\site-packages (from requests->torch_geometric) (3.4)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in c:\\balkanid\\.venv\\lib\\site-packages (from requests->torch_geometric) (2.0.4)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\balkanid\\.venv\\lib\\site-packages (from requests->torch_geometric) (2023.7.22)\n",
      "Requirement already satisfied: joblib>=1.1.1 in c:\\balkanid\\.venv\\lib\\site-packages (from scikit-learn->torch_geometric) (1.3.2)\n",
      "Requirement already satisfied: threadpoolctl>=2.0.0 in c:\\balkanid\\.venv\\lib\\site-packages (from scikit-learn->torch_geometric) (3.2.0)\n",
      "Requirement already satisfied: colorama in c:\\balkanid\\.venv\\lib\\site-packages (from tqdm->torch_geometric) (0.4.6)\n",
      "Requirement already satisfied: networkx in c:\\balkanid\\.venv\\lib\\site-packages (3.1)\n",
      "Requirement already satisfied: torch in c:\\balkanid\\.venv\\lib\\site-packages (2.0.1)\n",
      "Requirement already satisfied: filelock in c:\\balkanid\\.venv\\lib\\site-packages (from torch) (3.12.2)\n",
      "Requirement already satisfied: typing-extensions in c:\\balkanid\\.venv\\lib\\site-packages (from torch) (4.7.1)\n",
      "Requirement already satisfied: sympy in c:\\balkanid\\.venv\\lib\\site-packages (from torch) (1.12)\n",
      "Requirement already satisfied: networkx in c:\\balkanid\\.venv\\lib\\site-packages (from torch) (3.1)\n",
      "Requirement already satisfied: jinja2 in c:\\balkanid\\.venv\\lib\\site-packages (from torch) (3.1.2)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in c:\\balkanid\\.venv\\lib\\site-packages (from jinja2->torch) (2.1.3)\n",
      "Requirement already satisfied: mpmath>=0.19 in c:\\balkanid\\.venv\\lib\\site-packages (from sympy->torch) (1.3.0)\n"
     ]
    }
   ],
   "source": [
    "# !pip install neo4j\n",
    "# !pip install torch_geometric\n",
    "# !pip install networkx\n",
    "# !pip install torch"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record numAuthors=347>]\n",
      "[<Record numCoAuthorships=2519>]\n",
      "[<Record networkDensity=2.2880886680120627e-06>]\n",
      "[<Record averageDegree=8.178571428571427>]\n",
      "[<Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:15' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '0', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '0', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '0', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '0', 'Feature157': '0', 'Feature156': '0', 'Feature159': '0', 'Feature158': '0', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '1', 'Feature77': '0', 'Feature118': '0', 'Feature79': '0', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '0', 'Feature132': '0', 'Feature61': '0', 'Feature60': '0', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '0', 'Feature127': '0', 'Feature67': '0', 'Feature66': '0', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '0', 'Feature223': '0', 'Feature222': '0', 'Feature101': '0', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '0', 'Feature219': '0', 'Feature216': '0', 'Feature215': '0', 'Feature218': '0', 'Feature217': '0', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '1', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '0', 'Feature200': '0', 'Feature203': '0', 'Feature202': '0', 'Feature212': '0', 'Feature211': '0', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '0', 'Feature208': '0', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '0', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '0', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '0', 'Feature189': '0', 'Feature186': '0', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '0', 'Feature54': '0', 'Feature53': '0', 'Feature56': '0', 'Feature55': '0', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '0', 'Feature192': '0', 'Feature195': '0', 'Feature194': '0', 'Feature191': '0', 'Feature190': '0', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '0', 'author_id': 'authorID_f10d9_1a759_6bf5a_67735_79ff1', 'Feature160': '0', 'Feature162': '0', 'Feature161': '0', 'Feature168': '0', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '0', 'Feature173': '0', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '0', 'Feature174': '0', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=42>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:85' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '0', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '0', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '0', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '1', 'Feature157': '0', 'Feature156': '0', 'Feature159': '0', 'Feature158': '0', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '0', 'Feature77': '0', 'Feature118': '0', 'Feature79': '1', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '1', 'Feature132': '0', 'Feature61': '0', 'Feature60': '1', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '0', 'Feature127': '0', 'Feature67': '0', 'Feature66': '1', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '0', 'Feature223': '0', 'Feature222': '0', 'Feature101': '0', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '0', 'Feature219': '0', 'Feature216': '0', 'Feature215': '0', 'Feature218': '1', 'Feature217': '0', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '0', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '1', 'Feature200': '0', 'Feature203': '1', 'Feature202': '0', 'Feature212': '0', 'Feature211': '1', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '0', 'Feature208': '0', 'Feature205': '0', 'Feature204': '1', 'Feature207': '0', 'Feature206': '0', 'Feature10': '0', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '1', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '1', 'Feature189': '0', 'Feature186': '1', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '1', 'Feature54': '1', 'Feature53': '0', 'Feature56': '1', 'Feature55': '0', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '1', 'Feature192': '0', 'Feature195': '1', 'Feature194': '0', 'Feature191': '0', 'Feature190': '0', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '1', 'author_id': 'authorID_b7a56_873cd_771f2_c446d_369b6', 'Feature160': '0', 'Feature162': '1', 'Feature161': '0', 'Feature168': '0', 'Feature167': '1', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '1', 'Feature173': '0', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '0', 'Feature174': '0', 'Feature177': '0', 'Feature176': '1', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=39>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:60' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '0', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '0', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '0', 'Feature138': '0', 'Feature97': '0', 'Feature99': '1', 'Feature151': '0', 'Feature150': '1', 'Feature157': '0', 'Feature156': '0', 'Feature159': '0', 'Feature158': '0', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '0', 'Feature77': '0', 'Feature118': '0', 'Feature79': '1', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '1', 'Feature132': '0', 'Feature61': '0', 'Feature60': '1', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '0', 'Feature127': '0', 'Feature67': '0', 'Feature66': '1', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '1', 'Feature223': '0', 'Feature222': '0', 'Feature101': '0', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '1', 'Feature219': '0', 'Feature216': '0', 'Feature215': '1', 'Feature218': '0', 'Feature217': '1', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '0', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '0', 'Feature200': '1', 'Feature203': '0', 'Feature202': '1', 'Feature212': '0', 'Feature211': '0', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '0', 'Feature208': '0', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '0', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '0', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '1', 'Feature189': '0', 'Feature186': '1', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '1', 'Feature54': '1', 'Feature53': '0', 'Feature56': '1', 'Feature55': '0', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '1', 'Feature192': '0', 'Feature195': '0', 'Feature194': '0', 'Feature191': '0', 'Feature190': '1', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '1', 'Feature48': '0', 'author_id': 'authorID_49d18_0ecf5_61328_19571_bf39d', 'Feature160': '0', 'Feature162': '0', 'Feature161': '0', 'Feature168': '0', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '0', 'Feature173': '0', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '0', 'Feature174': '1', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=38>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:34' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '0', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '0', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '1', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '1', 'Feature157': '0', 'Feature156': '0', 'Feature159': '1', 'Feature158': '1', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '1', 'Feature116': '0', 'Feature119': '0', 'Feature78': '1', 'Feature77': '0', 'Feature118': '0', 'Feature79': '0', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '0', 'Feature132': '0', 'Feature61': '0', 'Feature60': '1', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '1', 'Feature127': '0', 'Feature67': '0', 'Feature66': '1', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '0', 'Feature223': '0', 'Feature222': '0', 'Feature101': '0', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '0', 'Feature219': '0', 'Feature216': '0', 'Feature215': '0', 'Feature218': '0', 'Feature217': '1', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '1', 'Feature7': '0', 'Feature6': '0', 'Feature113': '0', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '1', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '0', 'Feature200': '0', 'Feature203': '0', 'Feature202': '0', 'Feature212': '0', 'Feature211': '1', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '0', 'Feature208': '0', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '1', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '0', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '0', 'Feature189': '0', 'Feature186': '1', 'Feature185': '0', 'Feature188': '0', 'Feature187': '1', 'Feature50': '0', 'Feature52': '0', 'Feature51': '1', 'Feature54': '1', 'Feature53': '0', 'Feature56': '1', 'Feature55': '1', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '0', 'Feature192': '0', 'Feature195': '0', 'Feature194': '1', 'Feature191': '0', 'Feature190': '1', 'Feature197': '1', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '0', 'author_id': 'authorID_7688b_6ef52_55596_2d008_fff89', 'Feature160': '0', 'Feature162': '0', 'Feature161': '0', 'Feature168': '0', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '1', 'Feature173': '0', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '0', 'Feature174': '1', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=36>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:1' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '1', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '0', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '0', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '0', 'Feature157': '0', 'Feature156': '0', 'Feature159': '0', 'Feature158': '0', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '1', 'Feature77': '0', 'Feature118': '0', 'Feature79': '0', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '0', 'Feature132': '0', 'Feature61': '0', 'Feature60': '1', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '0', 'Feature127': '0', 'Feature67': '0', 'Feature66': '0', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '0', 'Feature223': '0', 'Feature222': '0', 'Feature101': '0', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '0', 'Feature219': '0', 'Feature216': '0', 'Feature215': '0', 'Feature218': '0', 'Feature217': '0', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '0', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '0', 'Feature200': '0', 'Feature203': '0', 'Feature202': '0', 'Feature212': '0', 'Feature211': '0', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '0', 'Feature208': '0', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '0', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '0', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '0', 'Feature189': '0', 'Feature186': '0', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '1', 'Feature54': '1', 'Feature53': '0', 'Feature56': '0', 'Feature55': '0', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '0', 'Feature192': '0', 'Feature195': '0', 'Feature194': '0', 'Feature191': '0', 'Feature190': '0', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '0', 'author_id': 'authorID_1be00_34108_2e25c_4e251_ca671', 'Feature160': '0', 'Feature162': '0', 'Feature161': '0', 'Feature168': '0', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '0', 'Feature173': '0', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '0', 'Feature174': '0', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=35>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:7' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '0', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '1', 'Feature92': '0', 'Feature144': '1', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '1', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '0', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '1', 'Feature157': '0', 'Feature156': '0', 'Feature159': '0', 'Feature158': '0', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '1', 'Feature77': '0', 'Feature118': '0', 'Feature79': '0', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '1', 'Feature132': '0', 'Feature61': '0', 'Feature60': '1', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '0', 'Feature127': '0', 'Feature67': '0', 'Feature66': '1', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '0', 'Feature223': '0', 'Feature222': '0', 'Feature101': '1', 'Feature104': '0', 'Feature103': '0', 'Feature224': '1', 'Feature100': '0', 'Feature221': '1', 'Feature220': '0', 'Feature219': '1', 'Feature216': '1', 'Feature215': '0', 'Feature218': '0', 'Feature217': '1', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '0', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '0', 'Feature200': '0', 'Feature203': '0', 'Feature202': '0', 'Feature212': '0', 'Feature211': '1', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '1', 'Feature208': '1', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '0', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '1', 'Feature16': '0', 'Feature15': '0', 'Feature18': '0', 'Feature17': '1', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '1', 'Feature189': '0', 'Feature186': '0', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '1', 'Feature54': '1', 'Feature53': '0', 'Feature56': '1', 'Feature55': '1', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '0', 'Feature192': '0', 'Feature195': '0', 'Feature194': '0', 'Feature191': '0', 'Feature190': '0', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '1', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '0', 'author_id': 'authorID_d6e5a_20b30_f8721_6b2c7_58f5e', 'Feature160': '0', 'Feature162': '0', 'Feature161': '1', 'Feature168': '0', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '1', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '1', 'Feature170': '1', 'Feature173': '1', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '1', 'Feature174': '0', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=34>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:14' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '1', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '0', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '0', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '0', 'Feature157': '0', 'Feature156': '0', 'Feature159': '0', 'Feature158': '0', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '1', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '1', 'Feature77': '0', 'Feature118': '0', 'Feature79': '0', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '1', 'Feature132': '0', 'Feature61': '0', 'Feature60': '0', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '0', 'Feature127': '0', 'Feature67': '0', 'Feature66': '0', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '0', 'Feature223': '0', 'Feature222': '0', 'Feature101': '0', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '0', 'Feature219': '0', 'Feature216': '0', 'Feature215': '0', 'Feature218': '0', 'Feature217': '0', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '0', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '0', 'Feature200': '0', 'Feature203': '0', 'Feature202': '0', 'Feature212': '0', 'Feature211': '0', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '0', 'Feature208': '0', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '1', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '0', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '0', 'Feature189': '0', 'Feature186': '0', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '1', 'Feature54': '1', 'Feature53': '0', 'Feature56': '1', 'Feature55': '0', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '0', 'Feature192': '0', 'Feature195': '0', 'Feature194': '0', 'Feature191': '0', 'Feature190': '0', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '0', 'author_id': 'authorID_79bf0_8685d_3138f_9b109_c3546', 'Feature160': '0', 'Feature162': '0', 'Feature161': '0', 'Feature168': '0', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '0', 'Feature173': '0', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '0', 'Feature174': '0', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=33>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:3' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '0', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '1', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '1', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '1', 'Feature157': '0', 'Feature156': '0', 'Feature159': '1', 'Feature158': '0', 'Feature153': '1', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '0', 'Feature77': '0', 'Feature118': '0', 'Feature79': '1', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '0', 'Feature132': '0', 'Feature61': '0', 'Feature60': '1', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '0', 'Feature127': '0', 'Feature67': '0', 'Feature66': '0', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '0', 'Feature223': '0', 'Feature222': '0', 'Feature101': '1', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '0', 'Feature219': '0', 'Feature216': '0', 'Feature215': '0', 'Feature218': '1', 'Feature217': '0', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '0', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '0', 'Feature200': '0', 'Feature203': '0', 'Feature202': '0', 'Feature212': '0', 'Feature211': '1', 'Feature214': '1', 'Feature213': '0', 'Feature210': '0', 'Feature209': '1', 'Feature208': '0', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '0', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '1', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '1', 'Feature180': '1', 'Feature189': '0', 'Feature186': '1', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '1', 'Feature54': '1', 'Feature53': '0', 'Feature56': '1', 'Feature55': '0', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '0', 'Feature192': '0', 'Feature195': '0', 'Feature194': '0', 'Feature191': '0', 'Feature190': '0', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '0', 'author_id': 'authorID_3635a_91e3d_a857f_7847f_68185', 'Feature160': '0', 'Feature162': '0', 'Feature161': '1', 'Feature168': '1', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '1', 'Feature173': '0', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '0', 'Feature174': '1', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=33>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:27' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '0', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '0', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '0', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '1', 'Feature157': '1', 'Feature156': '0', 'Feature159': '0', 'Feature158': '0', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '0', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '1', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '0', 'Feature77': '0', 'Feature118': '0', 'Feature79': '1', 'Feature135': '0', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '0', 'Feature132': '0', 'Feature61': '0', 'Feature60': '0', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '1', 'Feature127': '0', 'Feature67': '0', 'Feature66': '1', 'Feature129': '1', 'Feature69': '0', 'Feature68': '0', 'Feature102': '0', 'Feature223': '0', 'Feature222': '0', 'Feature101': '0', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '0', 'Feature219': '0', 'Feature216': '0', 'Feature215': '0', 'Feature218': '1', 'Feature217': '0', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '0', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '1', 'Feature200': '0', 'Feature203': '0', 'Feature202': '0', 'Feature212': '1', 'Feature211': '0', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '0', 'Feature208': '0', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '0', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '1', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '1', 'Feature189': '0', 'Feature186': '0', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '1', 'Feature54': '1', 'Feature53': '1', 'Feature56': '1', 'Feature55': '1', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '0', 'Feature192': '0', 'Feature195': '0', 'Feature194': '0', 'Feature191': '0', 'Feature190': '0', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '0', 'author_id': 'authorID_3038b_fb575_bee6a_0e619_45eff', 'Feature160': '0', 'Feature162': '0', 'Feature161': '0', 'Feature168': '0', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '0', 'Feature173': '0', 'Feature172': '1', 'Feature179': '0', 'Feature178': '0', 'Feature175': '1', 'Feature174': '0', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '1', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=31>, <Record a=<Node element_id='4:90d4a046-c6c5-4c79-987b-3b140a0d4b7c:63' labels=frozenset({'Author'}) properties={'Feature140': '0', 'Feature146': '0', 'Feature145': '0', 'Feature148': '0', 'Feature147': '0', 'Feature90': '0', 'Feature142': '0', 'Feature141': '0', 'Feature92': '0', 'Feature144': '0', 'Feature143': '0', 'Feature91': '0', 'Feature94': '0', 'Feature93': '0', 'Feature96': '0', 'Feature95': '0', 'Feature98': '0', 'Feature139': '0', 'Feature138': '0', 'Feature97': '0', 'Feature99': '0', 'Feature151': '0', 'Feature150': '0', 'Feature157': '0', 'Feature156': '0', 'Feature159': '0', 'Feature158': '0', 'Feature153': '0', 'Feature152': '0', 'Feature81': '0', 'Feature155': '0', 'Feature80': '0', 'Feature154': '0', 'Feature83': '1', 'Feature82': '0', 'Feature85': '0', 'Feature84': '0', 'Feature87': '0', 'Feature149': '0', 'Feature86': '0', 'Feature89': '0', 'Feature88': '0', 'Feature124': '0', 'Feature123': '0', 'Feature126': '0', 'Feature125': '0', 'Feature120': '0', 'Feature70': '0', 'Feature122': '0', 'Feature121': '0', 'Feature72': '0', 'Feature71': '0', 'Feature74': '0', 'Feature73': '0', 'Feature117': '0', 'Feature76': '0', 'Feature75': '0', 'Feature116': '0', 'Feature119': '0', 'Feature78': '1', 'Feature77': '0', 'Feature118': '0', 'Feature79': '0', 'Feature135': '1', 'Feature134': '0', 'Feature137': '0', 'Feature136': '0', 'Feature131': '0', 'Feature130': '0', 'Feature133': '0', 'Feature132': '0', 'Feature61': '0', 'Feature60': '0', 'Feature63': '0', 'Feature62': '0', 'Feature65': '0', 'Feature128': '1', 'Feature64': '0', 'Feature127': '0', 'Feature67': '0', 'Feature66': '0', 'Feature129': '0', 'Feature69': '0', 'Feature68': '0', 'Feature102': '1', 'Feature223': '0', 'Feature222': '0', 'Feature101': '0', 'Feature104': '0', 'Feature103': '0', 'Feature224': '0', 'Feature100': '0', 'Feature221': '0', 'Feature220': '0', 'Feature219': '0', 'Feature216': '0', 'Feature215': '0', 'Feature218': '0', 'Feature217': '0', 'Feature5': '0', 'Feature4': '0', 'Feature3': '0', 'Feature2': '0', 'Feature1': '0', 'Feature9': '0', 'Feature8': '0', 'Feature7': '0', 'Feature6': '0', 'Feature113': '1', 'Feature112': '0', 'Feature115': '0', 'Feature114': '0', 'Feature111': '0', 'Feature110': '0', 'Feature109': '0', 'Feature106': '0', 'Feature105': '0', 'Feature108': '0', 'Feature107': '0', 'Feature201': '0', 'Feature200': '0', 'Feature203': '0', 'Feature202': '0', 'Feature212': '0', 'Feature211': '0', 'Feature214': '0', 'Feature213': '0', 'Feature210': '0', 'Feature209': '0', 'Feature208': '0', 'Feature205': '0', 'Feature204': '0', 'Feature207': '0', 'Feature206': '0', 'Feature10': '0', 'Feature12': '0', 'Feature11': '0', 'Feature14': '0', 'Feature13': '0', 'Feature16': '0', 'Feature15': '0', 'Feature18': '0', 'Feature17': '0', 'Feature19': '0', 'Feature182': '0', 'Feature181': '0', 'Feature184': '0', 'Feature183': '0', 'Feature180': '0', 'Feature189': '0', 'Feature186': '0', 'Feature185': '0', 'Feature188': '0', 'Feature187': '0', 'Feature50': '0', 'Feature52': '0', 'Feature51': '0', 'Feature54': '0', 'Feature53': '0', 'Feature56': '0', 'Feature55': '0', 'Feature58': '0', 'Feature57': '0', 'Feature59': '0', 'Feature193': '0', 'Feature192': '0', 'Feature195': '0', 'Feature194': '0', 'Feature191': '0', 'Feature190': '0', 'Feature197': '0', 'Feature196': '0', 'Feature199': '0', 'Feature198': '0', 'Feature41': '0', 'Feature40': '0', 'Feature43': '0', 'Feature42': '0', 'Feature45': '0', 'Feature44': '0', 'Feature47': '0', 'Feature46': '0', 'Feature49': '0', 'Feature48': '0', 'author_id': 'authorID_377ad_eb4cd_4096a_dc7ca_64b53', 'Feature160': '0', 'Feature162': '0', 'Feature161': '0', 'Feature168': '0', 'Feature167': '0', 'Feature169': '0', 'Feature164': '0', 'Feature163': '0', 'Feature166': '0', 'Feature165': '0', 'Feature30': '0', 'Feature32': '0', 'Feature31': '0', 'Feature34': '0', 'Feature33': '0', 'Feature36': '0', 'Feature35': '0', 'Feature38': '0', 'Feature37': '0', 'Feature39': '0', 'Feature171': '0', 'Feature170': '0', 'Feature173': '0', 'Feature172': '0', 'Feature179': '0', 'Feature178': '0', 'Feature175': '0', 'Feature174': '0', 'Feature177': '0', 'Feature176': '0', 'Feature21': '0', 'Feature20': '0', 'Feature23': '0', 'Feature22': '0', 'Feature25': '0', 'Feature24': '0', 'Feature27': '0', 'Feature26': '0', 'Feature29': '0', 'Feature28': '0'}> degree=28>]\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import networkx as nx\n",
    "uri = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"Swayam2003\"\n",
    "\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "query1 = \"MATCH (a:Author) RETURN COUNT(a) AS numAuthors\"\n",
    "query2 = \"MATCH ()-[e:CO_AUTHORED]->() RETURN COUNT(e) AS numCoAuthorships;\"\n",
    "query3 = \"MATCH ()-[e:CO_AUTHORED]->() MATCH (a:Author) With COUNT(a) AS numAuthors,COUNT(e) AS numCoAuthorships RETURN (2.0 * numCoAuthorships) / (numAuthors * (numAuthors - 1)) AS networkDensity;\"\n",
    "query4 = \"MATCH (a:Author) MATCH (a)-[e:CO_AUTHORED]->() WITH a, COUNT(e) AS degree RETURN AVG(degree) AS averageDegree;\"\n",
    "query5 = \"MATCH (a:Author)-[e:CO_AUTHORED]->() WITH a, COUNT(e) AS degree RETURN a, degree ORDER BY degree DESC LIMIT 10;\"\n",
    "\n",
    "def run_query(query):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        records = [record for record in result]\n",
    "        return records\n",
    "\n",
    "print(run_query(query1))\n",
    "print(run_query(query2))\n",
    "print(run_query(query3))\n",
    "print(run_query(query4))\n",
    "print(run_query(query5))\n",
    "\n",
    "\n",
    "\n",
    "driver.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Data(x=[333, 224], edge_index=[2, 2519], y=[333])\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import networkx as nx\n",
    "import torch\n",
    "from torch_geometric.data import Data\n",
    "\n",
    "\n",
    "uri = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"Swayam2003\"\n",
    "driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "\n",
    "def run_query(query):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        records = [record for record in result]\n",
    "        return records\n",
    "\n",
    "\n",
    "query = \" MATCH (a:Author)-[:CO_AUTHORED]->(b:Author) RETURN a.author_id AS author1, b.author_id AS author2 \"\n",
    "records = run_query(query)\n",
    "\n",
    "\n",
    "G = nx.Graph()\n",
    "author_to_index = {}\n",
    "index = 0\n",
    "for record in records:\n",
    "    author1 = record[\"author1\"]\n",
    "    author2 = record[\"author2\"]\n",
    "    if author1 not in author_to_index:\n",
    "        author_to_index[author1] = index\n",
    "        index += 1\n",
    "    if author2 not in author_to_index:\n",
    "        author_to_index[author2] = index\n",
    "        index += 1\n",
    "    G.add_edge(author_to_index[author1], author_to_index[author2])\n",
    "\n",
    "\n",
    "author_features_query = \"MATCH (a:Author) RETURN a.author_id AS author_id,a.Feature28 AS Feature28,a.Feature24 AS Feature24,        a.Feature27 AS Feature27,        a.Feature26 AS Feature26,        a.Feature29 AS Feature29,        a.Feature20 AS Feature20,        a.Feature23 AS Feature23,        a.Feature22 AS Feature22,        a.Feature25 AS Feature25,        a.Feature174 AS Feature174,        a.Feature177 AS Feature177,        a.Feature176 AS Feature176,        a.Feature21 AS Feature21,        a.Feature172 AS Feature172,        a.Feature179 AS Feature179,        a.Feature178 AS Feature178,        a.Feature175 AS Feature175,        a.Feature39 AS Feature39,        a.Feature171 AS Feature171,        a.Feature170 AS Feature170,        a.Feature173 AS Feature173,        a.Feature36 AS Feature36,        a.Feature35 AS Feature35,        a.Feature38 AS Feature38,        a.Feature37 AS Feature37,        a.Feature32 AS Feature32,        a.Feature31 AS Feature31,        a.Feature34 AS Feature34,        a.Feature33 AS Feature33,        a.Feature163 AS Feature163,        a.Feature166 AS Feature166,        a.Feature165 AS Feature165,        a.Feature30 AS Feature30,        a.Feature168 AS Feature168,        a.Feature167 AS Feature167,        a.Feature169 AS Feature169,        a.Feature164 AS Feature164,        a.Feature48 AS Feature48,        a.Feature160 AS Feature160,        a.Feature162 AS Feature162,        a.Feature161 AS Feature161,        a.Feature44 AS Feature44,        a.Feature47 AS Feature47,        a.Feature46 AS Feature46,        a.Feature49 AS Feature49,        a.Feature40 AS Feature40,        a.Feature43 AS Feature43,        a.Feature42 AS Feature42,        a.Feature45 AS Feature45,        a.Feature196 AS Feature196,        a.Feature199 AS Feature199,        a.Feature198 AS Feature198,        a.Feature41 AS Feature41,        a.Feature194 AS Feature194,        a.Feature191 AS Feature191,        a.Feature190 AS Feature190,        a.Feature197 AS Feature197,        a.Feature59 AS Feature59,        a.Feature193 AS Feature193,        a.Feature192 AS Feature192,        a.Feature195 AS Feature195,        a.Feature56 AS Feature56,        a.Feature55 AS Feature55,        a.Feature58 AS Feature58,        a.Feature57 AS Feature57,        a.Feature52 AS Feature52,        a.Feature51 AS Feature51,        a.Feature54 AS Feature54,        a.Feature53 AS Feature53,        a.Feature185 AS Feature185,        a.Feature188 AS Feature188,        a.Feature187 AS Feature187,        a.Feature50 AS Feature50,        a.Feature183 AS Feature183,        a.Feature180 AS Feature180,        a.Feature189 AS Feature189,        a.Feature186 AS Feature186,        a.Feature19 AS Feature19,        a.Feature182 AS Feature182,        a.Feature181 AS Feature181,        a.Feature184 AS Feature184,        a.Feature16 AS Feature16,        a.Feature15 AS Feature15,        a.Feature18 AS Feature18,        a.Feature17 AS Feature17,        a.Feature12 AS Feature12,        a.Feature11 AS Feature11,        a.Feature14 AS Feature14,        a.Feature13 AS Feature13,        a.Feature204 AS Feature204,        a.Feature207 AS Feature207,        a.Feature206 AS Feature206,        a.Feature10 AS Feature10,        a.Feature210 AS Feature210,        a.Feature209 AS Feature209,        a.Feature208 AS Feature208,        a.Feature205 AS Feature205,        a.Feature212 AS Feature212,        a.Feature211 AS Feature211,        a.Feature214 AS Feature214,        a.Feature213 AS Feature213,        a.Feature201 AS Feature201,        a.Feature200 AS Feature200,        a.Feature203 AS Feature203,        a.Feature202 AS Feature202,        a.Feature106 AS Feature106,        a.Feature105 AS Feature105,        a.Feature108 AS Feature108,        a.Feature107 AS Feature107,        a.Feature114 AS Feature114,        a.Feature111 AS Feature111,        a.Feature110 AS Feature110,        a.Feature109 AS Feature109,        a.Feature6 AS Feature6,        a.Feature113 AS Feature113,        a.Feature112 AS Feature112,        a.Feature115 AS Feature115,        a.Feature1 AS Feature1,        a.Feature9 AS Feature9,        a.Feature8 AS Feature8,        a.Feature7 AS Feature7,        a.Feature5 AS Feature5,        a.Feature4 AS Feature4,        a.Feature3 AS Feature3,        a.Feature2 AS Feature2,        a.Feature216 AS Feature216,        a.Feature215 AS Feature215,        a.Feature218 AS Feature218,        a.Feature217 AS Feature217,        a.Feature100 AS Feature100,        a.Feature221 AS Feature221,        a.Feature220 AS Feature220,        a.Feature219 AS Feature219,        a.Feature222 AS Feature222,        a.Feature104 AS Feature104,        a.Feature103 AS Feature103,        a.Feature224 AS Feature224,        a.Feature68 AS Feature68,        a.Feature102 AS Feature102,        a.Feature223 AS Feature223,        a.Feature101 AS Feature101,        a.Feature67 AS Feature67,        a.Feature66 AS Feature66,        a.Feature129 AS Feature129,        a.Feature69 AS Feature69,        a.Feature65 AS Feature65,        a.Feature128 AS Feature128,        a.Feature64 AS Feature64,        a.Feature127 AS Feature127,        a.Feature61 AS Feature61,        a.Feature60 AS Feature60,        a.Feature63 AS Feature63,        a.Feature62 AS Feature62,        a.Feature131 AS Feature131,        a.Feature130 AS Feature130,        a.Feature133 AS Feature133,        a.Feature132 AS Feature132,        a.Feature135 AS Feature135,        a.Feature134 AS Feature134,        a.Feature137 AS Feature137,        a.Feature136 AS Feature136,        a.Feature119 AS Feature119,        a.Feature77 AS Feature77,        a.Feature118 AS Feature118,        a.Feature79 AS Feature79,        a.Feature117 AS Feature117,        a.Feature75 AS Feature75,        a.Feature116 AS Feature116,        a.Feature78 AS Feature78,        a.Feature71 AS Feature71,        a.Feature74 AS Feature74,        a.Feature73 AS Feature73,        a.Feature76 AS Feature76,        a.Feature70 AS Feature70,        a.Feature122 AS Feature122,        a.Feature121 AS Feature121,        a.Feature72 AS Feature72,        a.Feature123 AS Feature123,        a.Feature126 AS Feature126,        a.Feature125 AS Feature125,        a.Feature120 AS Feature120,        a.Feature149 AS Feature149,        a.Feature89 AS Feature89,        a.Feature88 AS Feature88,        a.Feature124 AS Feature124,        a.Feature85 AS Feature85,        a.Feature84 AS Feature84,        a.Feature87 AS Feature87,        a.Feature86 AS Feature86,        a.Feature80 AS Feature80,        a.Feature154 AS Feature154,        a.Feature83 AS Feature83,        a.Feature82 AS Feature82,        a.Feature153 AS Feature153,        a.Feature152 AS Feature152,        a.Feature81 AS Feature81,        a.Feature155 AS Feature155,        a.Feature157 AS Feature157,        a.Feature156 AS Feature156,        a.Feature159 AS Feature159,        a.Feature158 AS Feature158,        a.Feature138 AS Feature138,        a.Feature99 AS Feature99,        a.Feature151 AS Feature151,        a.Feature150 AS Feature150,        a.Feature95 AS Feature95,        a.Feature98 AS Feature98,        a.Feature139 AS Feature139,        a.Feature97 AS Feature97,        a.Feature143 AS Feature143,        a.Feature94 AS Feature94,        a.Feature93 AS Feature93,        a.Feature96 AS Feature96,        a.Feature141 AS Feature141,        a.Feature92 AS Feature92,        a.Feature144 AS Feature144,        a.Feature91 AS Feature91,        a.Feature148 AS Feature148,        a.Feature147 AS Feature147,        a.Feature90 AS Feature90,        a.Feature142 AS Feature142,        a.Feature140 AS Feature140,        a.Feature146 AS Feature146,        a.Feature145 AS Feature145  ORDER BY a.author_id\"\n",
    "author_features_records = run_query(author_features_query)\n",
    "\n",
    "\n",
    "author_features_dict = {}\n",
    "for record in author_features_records:\n",
    "    author_id = record[\"author_id\"]\n",
    "    features = [int(record[f\"Feature{i}\"]) for i in range(1, 225)]\n",
    "    author_features_dict[author_id] = features\n",
    "\n",
    "edge_index = torch.tensor(list(G.edges), dtype=torch.int).t().contiguous()\n",
    "\n",
    "sorted_author_ids = sorted(author_to_index, key=author_to_index.get)\n",
    "\n",
    "x = torch.tensor([author_features_dict[author_id] for author_id in sorted_author_ids], dtype=torch.float)\n",
    "\n",
    "num_classes = 2 \n",
    "y = torch.randint(0, num_classes, (x.size(0),), dtype=torch.float)\n",
    "\n",
    "data = Data(x=x,y=y, edge_index=edge_index)\n",
    "\n",
    "print(data)\n",
    "\n",
    "driver.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
